{"config": [{"config": {"name": "embedding_1", "W_regularizer": null, "activity_regularizer": null, "input_dim": 200000, "trainable": true, "batch_input_shape": [null, null], "output_dim": 64, "init": "uniform", "W_constraint": null, "input_dtype": "int32", "dropout": 0.2, "input_length": null, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "lstm_1", "W_regularizer": null, "U_regularizer": null, "input_dim": 64, "trainable": true, "consume_less": "cpu", "unroll": false, "dropout_W": 0.2, "output_dim": 64, "init": "glorot_uniform", "go_backwards": false, "inner_activation": "hard_sigmoid", "stateful": false, "b_regularizer": null, "inner_init": "orthogonal", "return_sequences": false, "input_length": null, "activation": "tanh", "dropout_U": 0.2, "forget_bias_init": "one"}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "W_regularizer": null, "activity_regularizer": null, "bias": true, "input_dim": null, "trainable": true, "b_constraint": null, "output_dim": 64, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "W_regularizer": null, "activity_regularizer": null, "bias": true, "input_dim": null, "trainable": true, "b_constraint": null, "output_dim": 46, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.1"}