{"config": [{"config": {"activity_regularizer": null, "W_constraint": null, "dropout": 0.2, "mask_zero": false, "batch_input_shape": [null, null], "init": "uniform", "name": "embedding_1", "input_length": null, "input_dim": 200000, "input_dtype": "int32", "output_dim": 64, "W_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"inner_activation": "hard_sigmoid", "go_backwards": false, "return_sequences": false, "activation": "tanh", "init": "glorot_uniform", "name": "lstm_1", "dropout_W": 0.2, "input_length": null, "dropout_U": 0.2, "output_dim": 64, "unroll": false, "consume_less": "cpu", "input_dim": 64, "forget_bias_init": "one", "b_regularizer": null, "inner_init": "orthogonal", "W_regularizer": null, "U_regularizer": null, "stateful": false, "trainable": true}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "name": "dense_1", "input_dim": null, "activation": "linear", "b_regularizer": null, "output_dim": 64, "W_regularizer": null, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "name": "dense_2", "input_dim": null, "activation": "linear", "b_regularizer": null, "output_dim": 46, "W_regularizer": null, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_2", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.1"}