{"config": [{"config": {"input_dim": 200000, "dropout": 0.2, "W_constraint": null, "mask_zero": false, "output_dim": 64, "batch_input_shape": [null, null], "init": "uniform", "name": "embedding_1", "trainable": true, "input_length": null, "W_regularizer": null, "input_dtype": "int32", "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"b_regularizer": null, "consume_less": "cpu", "input_dim": 64, "inner_activation": "hard_sigmoid", "return_sequences": false, "forget_bias_init": "one", "input_length": null, "output_dim": 64, "unroll": false, "dropout_W": 0.2, "init": "glorot_uniform", "dropout_U": 0.2, "name": "lstm_1", "go_backwards": false, "trainable": true, "W_regularizer": null, "inner_init": "orthogonal", "stateful": false, "U_regularizer": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"b_regularizer": null, "input_dim": null, "W_constraint": null, "output_dim": 64, "bias": true, "init": "glorot_uniform", "name": "dense_1", "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "input_dim": null, "W_constraint": null, "output_dim": 46, "bias": true, "init": "glorot_uniform", "name": "dense_2", "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "1.1.1", "class_name": "Sequential"}