{"config": [{"config": {"W_regularizer": null, "init": "uniform", "trainable": true, "batch_input_shape": [null, null], "name": "embedding_1", "W_constraint": null, "input_dim": 200000, "input_length": null, "input_dtype": "int32", "mask_zero": false, "activity_regularizer": null, "output_dim": 64, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"W_regularizer": null, "input_length": null, "trainable": true, "name": "lstm_1", "return_sequences": false, "stateful": false, "forget_bias_init": "one", "activation": "tanh", "dropout_U": 0.2, "unroll": false, "init": "glorot_uniform", "U_regularizer": null, "b_regularizer": null, "inner_activation": "hard_sigmoid", "dropout_W": 0.2, "go_backwards": false, "consume_less": "cpu", "input_dim": 64, "output_dim": 64, "inner_init": "orthogonal"}, "class_name": "LSTM"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "W_constraint": null, "input_dim": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 64}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "W_constraint": null, "input_dim": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 46}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.1.1", "class_name": "Sequential"}