{"keras_version": "1.1.1", "config": [{"config": {"input_dtype": "int32", "init": "uniform", "name": "embedding_1", "dropout": 0.2, "W_constraint": null, "input_dim": 200000, "activity_regularizer": null, "input_length": null, "trainable": true, "W_regularizer": null, "batch_input_shape": [null, null], "output_dim": 256, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"go_backwards": false, "init": "glorot_uniform", "name": "lstm_1", "consume_less": "cpu", "activation": "tanh", "unroll": false, "dropout_W": 0.2, "input_dim": 256, "forget_bias_init": "one", "dropout_U": 0.2, "inner_init": "orthogonal", "return_sequences": false, "input_length": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 256, "U_regularizer": null, "stateful": false, "inner_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"init": "glorot_uniform", "name": "dense_1", "bias": true, "activation": "linear", "W_constraint": null, "input_dim": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 256, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "dense_2", "bias": true, "activation": "linear", "W_constraint": null, "input_dim": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 46, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}