{"config": [{"config": {"init": "uniform", "name": "embedding_1", "activity_regularizer": null, "input_dim": 200000, "trainable": true, "batch_input_shape": [null, null], "W_regularizer": null, "input_dtype": "int32", "input_length": null, "W_constraint": null, "mask_zero": false, "output_dim": 128, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"init": "glorot_uniform", "name": "lstm_1", "U_regularizer": null, "input_dim": 128, "trainable": true, "return_sequences": false, "unroll": false, "input_length": null, "b_regularizer": null, "activation": "tanh", "W_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "go_backwards": false, "consume_less": "cpu", "stateful": false, "dropout_U": 0.2, "output_dim": 128, "forget_bias_init": "one", "dropout_W": 0.2}, "class_name": "LSTM"}, {"config": {"init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "activation": "linear", "input_dim": null, "output_dim": 128}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "activation": "linear", "input_dim": null, "output_dim": 46}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.1"}