{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "trainable": true, "output_dim": 64, "init": "uniform", "W_regularizer": null, "batch_input_shape": [null, null], "dropout": 0.2, "name": "embedding_1", "input_length": null, "mask_zero": false, "input_dim": 200000, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "LSTM", "config": {"trainable": true, "output_dim": 64, "dropout_W": 0.2, "init": "glorot_uniform", "U_regularizer": null, "W_regularizer": null, "dropout_U": 0.2, "go_backwards": false, "consume_less": "cpu", "stateful": false, "inner_activation": "hard_sigmoid", "forget_bias_init": "one", "activation": "tanh", "return_sequences": false, "name": "lstm_1", "input_length": null, "b_regularizer": null, "unroll": false, "input_dim": 64, "inner_init": "orthogonal"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 64, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "name": "dense_1", "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 46, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "name": "dense_2", "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_2"}}]}