{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 128, "trainable": true, "W_regularizer": null, "input_dim": 200000, "activity_regularizer": null, "input_length": null, "batch_input_shape": [null, null], "input_dtype": "int32", "init": "uniform", "dropout": 0.2, "name": "embedding_1", "mask_zero": false, "W_constraint": null}}, {"class_name": "LSTM", "config": {"output_dim": 128, "trainable": true, "b_regularizer": null, "forget_bias_init": "one", "W_regularizer": null, "activation": "tanh", "inner_activation": "hard_sigmoid", "unroll": false, "input_length": null, "inner_init": "orthogonal", "dropout_U": 0.2, "return_sequences": false, "stateful": false, "init": "glorot_uniform", "consume_less": "cpu", "input_dim": 128, "name": "lstm_1", "dropout_W": 0.2, "U_regularizer": null, "go_backwards": false}}, {"class_name": "Dense", "config": {"output_dim": 128, "trainable": true, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "name": "dense_1", "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Dense", "config": {"output_dim": 46, "trainable": true, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "name": "dense_2", "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "softmax"}}]}