{"config": [{"config": {"input_length": null, "activity_regularizer": null, "input_dtype": "int32", "name": "embedding_1", "dropout": 0.2, "batch_input_shape": [null, null], "init": "uniform", "trainable": true, "mask_zero": false, "W_constraint": null, "W_regularizer": null, "output_dim": 128, "input_dim": 200000}, "class_name": "Embedding"}, {"config": {"unroll": false, "input_length": null, "dropout_W": 0.2, "output_dim": 128, "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "activation": "tanh", "name": "lstm_1", "init": "glorot_uniform", "trainable": true, "U_regularizer": null, "forget_bias_init": "one", "consume_less": "cpu", "return_sequences": false, "dropout_U": 0.2, "stateful": false, "W_regularizer": null, "b_regularizer": null, "go_backwards": false, "input_dim": 128}, "class_name": "LSTM"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "input_dim": null, "trainable": true, "name": "dense_1", "W_regularizer": null, "bias": true, "output_dim": 128, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "input_dim": null, "trainable": true, "name": "dense_2", "W_regularizer": null, "bias": true, "output_dim": 46, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_2"}, "class_name": "Activation"}], "keras_version": "1.1.1", "class_name": "Sequential"}