{"keras_version": "1.1.1", "config": [{"class_name": "Embedding", "config": {"input_dim": 200000, "trainable": true, "batch_input_shape": [null, null], "output_dim": 128, "activity_regularizer": null, "init": "uniform", "input_dtype": "int32", "W_constraint": null, "name": "embedding_1", "input_length": null, "mask_zero": false, "dropout": 0.2, "W_regularizer": null}}, {"class_name": "LSTM", "config": {"input_dim": 128, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "dropout_U": 0.2, "consume_less": "cpu", "unroll": false, "activation": "tanh", "stateful": false, "forget_bias_init": "one", "U_regularizer": null, "inner_activation": "hard_sigmoid", "return_sequences": false, "name": "lstm_1", "go_backwards": false, "output_dim": 128, "dropout_W": 0.2, "inner_init": "orthogonal", "W_regularizer": null, "input_length": null}}, {"class_name": "Dense", "config": {"input_dim": null, "trainable": true, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 128, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "trainable": true, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "name": "dense_2", "output_dim": 46, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "softmax"}}], "class_name": "Sequential"}