{"keras_version": "1.1.1", "config": [{"config": {"dropout": 0.2, "W_constraint": null, "mask_zero": false, "init": "uniform", "batch_input_shape": [null, null], "input_dim": 200000, "input_length": null, "name": "embedding_1", "input_dtype": "int32", "activity_regularizer": null, "trainable": true, "output_dim": 64, "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "activation": "tanh", "stateful": false, "b_regularizer": null, "input_length": null, "consume_less": "cpu", "go_backwards": false, "input_dim": 64, "dropout_W": 0.2, "inner_init": "orthogonal", "name": "lstm_1", "dropout_U": 0.2, "return_sequences": false, "inner_activation": "hard_sigmoid", "forget_bias_init": "one", "trainable": true, "output_dim": 64, "U_regularizer": null, "unroll": false}, "class_name": "LSTM"}, {"config": {"b_constraint": null, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "input_dim": null, "init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null, "trainable": true, "output_dim": 64, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "input_dim": null, "init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null, "trainable": true, "output_dim": 46, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}], "class_name": "Sequential"}